# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect
imgz: [640, 640]
# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 129 layers, 3157200 parameters, 3157184 gradients, 8.9 GFLOPS
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 129 layers, 11166560 parameters, 11166544 gradients, 28.8 GFLOPS
  #m: [0.67, 0.75, 768] # YOLOv8m summary: 169 layers, 25902640 parameters, 25902624 gradients, 79.3 GFLOPS
  m: [0.50, 0.75, 768] # YOLOv8m summary: 169 layers, 25902640 parameters, 25902624 gradients, 79.3 GFLOPS
  l: [1.00, 1.00, 512] # YOLOv8l summary: 209 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPS
  x: [1.00, 1.25, 512] # YOLOv8x summary: 209 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPS


# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]            # 0-320
  - [-1, 1, Conv, [128, 3, 2]]           # 1-160
  - [-1, 4, C2f, [128, True, 160]]       # 2-160
  - [-1, 1, TripletSelection, [False]]   # 3-160
  - [-1, 1, Conv, [256, 3, 2]]           # 4-80
  - [-1, 4, C2f, [256, True, 80]]        # 5-80
  - [-1, 1, TripletSelection, [False]]   # 6-80
  - [-1, 1, Conv, [512, 3, 2]]           # 7-40
  - [-1, 2, C2f, [512, True, 40]]        # 8-40
  - [-1, 1, Conv, [1024, 3, 2]]          # 9-20
  - [-1, 2, C2f, [1024, True, 20]]       # 10-20
  - [-1, 1, SPPF, [1024, 5]]             # 11-20

head:
  # 2) P5  → P4(40×40)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12-20→40
  - [[-1, 8], 1, Concat, [1]]                    # 13-cat P4(40×40)
  - [-1, 2, C2f, [512, False, 40]]               # 14-40

  # 3) P4  → P3(80×80)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15-40→80
  - [[-1, 5], 1, Concat, [1]]                    # 16-cat P3(80×80)
  - [-1, 2, C2f, [256, False, 80]]               # 17-80

  # 4) P3  → P2(160×160)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 18-80→160
  - [[-1, 2], 1, Concat, [1]]                    # 19-cat P2(160×160)
  - [-1, 2, C2f, [128, False, 160]]              # 20-160



    #Dense Aggregation Network : Down->concat-concat-up-concat-concat

  - [-1, 1, Conv, [128, 3, 2]]                   # 21-160→80 p3''
  - [[-1, 17], 1, Concat, [1]]                   # 22-cat P3
  - [-1, 2, C2f, [256, False, 80]]               # 23-80
  - [[-1, 6], 1, Concat, [1]]                    # 24-80
  - [ -1, 2, C2f, [ 256, False, 80] ]            # 25 80
  - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ]  # 26-160
  - [ [ -1, 20 ], 1, Concat, [ 1 ] ]             # 27-160
  - [ -1, 2, C2f, [ 128 , False, 160] ]          # 28-160
  - [[-1, 3], 1, Concat, [1]]                    # 29-160
  - [ -1, 2, C2f, [ 128, False, 160 ] ]          # 30-160


  # 6) 下采样至P3/8
  - [-1, 1, Conv, [128, 3, 2]]                   # 31-160→80
  - [[-1, 25], 1, Concat, [1]]                   # 32-cat P3
  - [-1, 2, C2f, [256, False, 80]]               # 33-80


  # 7) 下采样回 P4/16
  - [-1, 1, Conv, [256, 3, 2]]                   # 34-80→40
  - [[-1, 14], 1, Concat, [1]]                   # 35-cat P4
  - [-1, 2, C2f, [512,False, 40]]                # 36-P4/16
#
#   # 8) 下采样回 P5/32, optional
#  - [-1, 1, Conv, [512, 3, 2]]                   # 37-40→20
#  - [[-1, 11], 1, Concat, [1]]                   # 38-cat P5
#  - [-1, 2, C2f, [1024,False, 20]]               # 39-P5/32


  # 9) P2→P3→P4→P5)
  - [[30,33,36], 1, Detect, [nc]]  # 160 80 40 20

